micropython/micropython/ports/nrf/bluetooth/s140_nrf52_7.0.1/s140_nrf52_7.0.1_API/include/ble_gap.h
/*
 * Copyright (c) 2011 - 2020, Nordic Semiconductor ASA
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/**
  @addtogroup BLE_GAP Generic Access Profile (GAP)
  @{
  @brief Definitions and prototypes for the GAP interface.
 */

#ifndef BLE_GAP_H__
#define BLE_GAP_H__

#include <stdint.h>
#include "nrf_svc.h"
#include "nrf_error.h"
#include "ble_hci.h"
#include "ble_ranges.h"
#include "ble_types.h"
#include "ble_err.h"

#ifdef __cplusplus
extern "C" {
#endif

/**@addtogroup BLE_GAP_ENUMERATIONS Enumerations
 * @{ */

/**@brief GAP API SVC numbers.
 */
enum BLE_GAP_SVCS
{
    SD_BLE_GAP_ADDR_SET                   = BLE_GAP_SVC_BASE,     /**< Set own Bluetooth Address. */
    SD_BLE_GAP_ADDR_GET                   = BLE_GAP_SVC_BASE + 1, /**< Get own Bluetooth Address. */
    SD_BLE_GAP_WHITELIST_SET              = BLE_GAP_SVC_BASE + 2, /**< Set active whitelist. */
    SD_BLE_GAP_DEVICE_IDENTITIES_SET      = BLE_GAP_SVC_BASE + 3, /**< Set device identity list. */
    SD_BLE_GAP_PRIVACY_SET                = BLE_GAP_SVC_BASE + 4, /**< Set Privacy settings*/
    SD_BLE_GAP_PRIVACY_GET                = BLE_GAP_SVC_BASE + 5, /**< Get Privacy settings*/
    SD_BLE_GAP_ADV_SET_CONFIGURE          = BLE_GAP_SVC_BASE + 6, /**< Configure an advertising set. */
    SD_BLE_GAP_ADV_START                  = BLE_GAP_SVC_BASE + 7, /**< Start Advertising. */
    SD_BLE_GAP_ADV_STOP                   = BLE_GAP_SVC_BASE + 8, /**< Stop Advertising. */
    SD_BLE_GAP_CONN_PARAM_UPDATE          = BLE_GAP_SVC_BASE + 9, /**< Connection Parameter Update. */
    SD_BLE_GAP_DISCONNECT                 = BLE_GAP_SVC_BASE + 10,/**< Disconnect. */
    SD_BLE_GAP_TX_POWER_SET               = BLE_GAP_SVC_BASE + 11,/**< Set TX Power. */
    SD_BLE_GAP_APPEARANCE_SET             = BLE_GAP_SVC_BASE + 12,/**< Set Appearance. */
    SD_BLE_GAP_APPEARANCE_GET             = BLE_GAP_SVC_BASE + 13,/**< Get Appearance. */
    SD_BLE_GAP_PPCP_SET                   = BLE_GAP_SVC_BASE + 14,/**< Set PPCP. */
    SD_BLE_GAP_PPCP_GET                   = BLE_GAP_SVC_BASE + 15,/**< Get PPCP. */
    SD_BLE_GAP_DEVICE_NAME_SET            = BLE_GAP_SVC_BASE + 16,/**< Set Device Name. */
    SD_BLE_GAP_DEVICE_NAME_GET            = BLE_GAP_SVC_BASE + 17,/**< Get Device Name. */
    SD_BLE_GAP_AUTHENTICATE               = BLE_GAP_SVC_BASE + 18,/**< Initiate Pairing/Bonding. */
    SD_BLE_GAP_SEC_PARAMS_REPLY           = BLE_GAP_SVC_BASE + 19,/**< Reply with Security Parameters. */
    SD_BLE_GAP_AUTH_KEY_REPLY             = BLE_GAP_SVC_BASE + 20,/**< Reply with an authentication key. */
    SD_BLE_GAP_LESC_DHKEY_REPLY           = BLE_GAP_SVC_BASE + 21,/**< Reply with an LE Secure Connections DHKey. */
    SD_BLE_GAP_KEYPRESS_NOTIFY            = BLE_GAP_SVC_BASE + 22,/**< Notify of a keypress during an authentication procedure. */
    SD_BLE_GAP_LESC_OOB_DATA_GET          = BLE_GAP_SVC_BASE + 23,/**< Get the local LE Secure Connections OOB data. */
    SD_BLE_GAP_LESC_OOB_DATA_SET          = BLE_GAP_SVC_BASE + 24,/**< Set the remote LE Secure Connections OOB data. */
    SD_BLE_GAP_ENCRYPT                    = BLE_GAP_SVC_BASE + 25,/**< Initiate encryption procedure. */
    SD_BLE_GAP_SEC_INFO_REPLY             = BLE_GAP_SVC_BASE + 26,/**< Reply with Security Information. */
    SD_BLE_GAP_CONN_SEC_GET               = BLE_GAP_SVC_BASE + 27,/**< Obtain connection security level. */
    SD_BLE_GAP_RSSI_START                 = BLE_GAP_SVC_BASE + 28,/**< Start reporting of changes in RSSI. */
    SD_BLE_GAP_RSSI_STOP                  = BLE_GAP_SVC_BASE + 29,/**< Stop reporting of changes in RSSI. */
    SD_BLE_GAP_SCAN_START                 = BLE_GAP_SVC_BASE + 30,/**< Start Scanning. */
    SD_BLE_GAP_SCAN_STOP                  = BLE_GAP_SVC_BASE + 31,/**< Stop Scanning. */
    SD_BLE_GAP_CONNECT                    = BLE_GAP_SVC_BASE + 32,/**< Connect. */
    SD_BLE_GAP_CONNECT_CANCEL             = BLE_GAP_SVC_BASE + 33,/**< Cancel ongoing connection procedure. */
    SD_BLE_GAP_RSSI_GET                   = BLE_GAP_SVC_BASE + 34,/**< Get the last RSSI sample. */
    SD_BLE_GAP_PHY_UPDATE                 = BLE_GAP_SVC_BASE + 35,/**< Initiate or respond to a PHY Update Procedure. */
    SD_BLE_GAP_DATA_LENGTH_UPDATE         = BLE_GAP_SVC_BASE + 36,/**< Initiate or respond to a Data Length Update Procedure. */
    SD_BLE_GAP_QOS_CHANNEL_SURVEY_START   = BLE_GAP_SVC_BASE + 37,/**< Start Quality of Service (QoS) channel survey module. */
    SD_BLE_GAP_QOS_CHANNEL_SURVEY_STOP    = BLE_GAP_SVC_BASE + 38,/**< Stop Quality of Service (QoS) channel survey module. */
    SD_BLE_GAP_ADV_ADDR_GET               = BLE_GAP_SVC_BASE + 39,/**< Get the Address used on air while Advertising. */
    SD_BLE_GAP_NEXT_CONN_EVT_COUNTER_GET  = BLE_GAP_SVC_BASE + 40,/**< Get the next connection event counter. */
    SD_BLE_GAP_CONN_EVT_TRIGGER_START     = BLE_GAP_SVC_BASE + 41,/** Start triggering a given task on connection event start. */
    SD_BLE_GAP_CONN_EVT_TRIGGER_STOP      = BLE_GAP_SVC_BASE + 42,/** Stop triggering the task configured using @ref sd_ble_gap_conn_evt_trigger_start. */
};

