micropython/micropython/ports/nrf/bluetooth/s140_nrf52_7.0.1/s140_nrf52_7.0.1_API/include/ble_gap.h
/**@brief Privacy.
 *
 *        The privacy feature provides a way for the device to avoid being tracked over a period of time.
 *        The privacy feature, when enabled, hides the local device identity and replaces it with a private address
 *        that is automatically refreshed at a specified interval.
 *
 *        If a device still wants to be recognized by other peers, it needs to share it's Identity Resolving Key (IRK).
 *        With this key, a device can generate a random private address that can only be recognized by peers in possession of that key,
 *        and devices can establish connections without revealing their real identities.
 *
 *        Both network privacy (@ref BLE_GAP_PRIVACY_MODE_NETWORK_PRIVACY) and device privacy (@ref BLE_GAP_PRIVACY_MODE_DEVICE_PRIVACY)
 *        are supported.
 *
 * @note  If the device IRK is updated, the new IRK becomes the one to be distributed in all
 *        bonding procedures performed after @ref sd_ble_gap_privacy_set returns.
 *        The IRK distributed during bonding procedure is the device IRK that is active when @ref sd_ble_gap_sec_params_reply is called.
 */
typedef struct
{
    uint8_t privacy_mode;              /**< Privacy mode, see @ref BLE_GAP_PRIVACY_MODES. Default is @ref BLE_GAP_PRIVACY_MODE_OFF. */
    uint8_t private_addr_type;         /**< The private address type must be either @ref BLE_GAP_ADDR_TYPE_RANDOM_PRIVATE_RESOLVABLE or @ref BLE_GAP_ADDR_TYPE_RANDOM_PRIVATE_NON_RESOLVABLE. */
    uint16_t private_addr_cycle_s;     /**< Private address cycle interval in seconds. Providing an address cycle value of 0 will use the default value defined by @ref BLE_GAP_DEFAULT_PRIVATE_ADDR_CYCLE_INTERVAL_S. */
    ble_gap_irk_t *p_device_irk;       /**< When used as input, pointer to IRK structure that will be used as the default IRK. If NULL, the device default IRK will be used.
                                            When used as output, pointer to IRK structure where the current default IRK will be written to. If NULL, this argument is ignored.
                                            By default, the default IRK is used to generate random private resolvable addresses for the local device unless instructed otherwise. */
} ble_gap_privacy_params_t;


/**@brief PHY preferences for TX and RX
 * @note  tx_phys and rx_phys are bit fields. Multiple bits can be set in them to indicate multiple preferred PHYs for each direction.
 * @code
 * p_gap_phys->tx_phys = BLE_GAP_PHY_1MBPS | BLE_GAP_PHY_2MBPS;
 * p_gap_phys->rx_phys = BLE_GAP_PHY_1MBPS | BLE_GAP_PHY_2MBPS;
 * @endcode
 *
 */
typedef struct
{
    uint8_t tx_phys;   /**< Preferred transmit PHYs, see @ref BLE_GAP_PHYS. */
    uint8_t rx_phys;   /**< Preferred receive PHYs, see @ref BLE_GAP_PHYS. */
} ble_gap_phys_t;

/** @brief Keys that can be exchanged during a bonding procedure. */
typedef struct
{
    uint8_t enc     : 1;                      /**< Long Term Key and Master Identification. */
    uint8_t id      : 1;                      /**< Identity Resolving Key and Identity Address Information. */
    uint8_t sign    : 1;                      /**< Connection Signature Resolving Key. */
    uint8_t link    : 1;                      /**< Derive the Link Key from the LTK. */
} ble_gap_sec_kdist_t;


/**@brief GAP security parameters. */
typedef struct
{
    uint8_t bond      : 1;                         /**< Perform bonding. */
    uint8_t mitm      : 1;                         /**< Enable Man In The Middle protection. */
    uint8_t lesc      : 1;                         /**< Enable LE Secure Connection pairing. */
    uint8_t keypress  : 1;                         /**< Enable generation of keypress notifications. */
    uint8_t io_caps   : 3;                         /**< IO capabilities, see @ref BLE_GAP_IO_CAPS. */
    uint8_t oob       : 1;                         /**< The OOB data flag.
                                                        - In LE legacy pairing, this flag is set if a device has out of band authentication data.
                                                          The OOB method is used if both of the devices have out of band authentication data.
                                                        - In LE Secure Connections pairing, this flag is set if a device has the peer device's out of band authentication data.
                                                          The OOB method is used if at least one device has the peer device's OOB data available. */
    uint8_t min_key_size;                          /**< Minimum encryption key size in octets between 7 and 16. If 0 then not applicable in this instance. */
    uint8_t max_key_size;                          /**< Maximum encryption key size in octets between min_key_size and 16. */
    ble_gap_sec_kdist_t kdist_own;                 /**< Key distribution bitmap: keys that the local device will distribute. */
    ble_gap_sec_kdist_t kdist_peer;                /**< Key distribution bitmap: keys that the remote device will distribute. */
} ble_gap_sec_params_t;


/**@brief GAP Encryption Information. */
typedef struct
{
    uint8_t ltk[BLE_GAP_SEC_KEY_LEN];   /**< Long Term Key. */
    uint8_t lesc : 1;                   /**< Key generated using LE Secure Connections. */
    uint8_t auth : 1;                   /**< Authenticated Key. */
    uint8_t ltk_len : 6;                /**< LTK length in octets. */
} ble_gap_enc_info_t;


/**@brief GAP Master Identification. */
typedef struct
{
    uint16_t ediv;                      /**< Encrypted Diversifier. */
    uint8_t rand[BLE_GAP_SEC_RAND_LEN]; /**< Random Number. */
} ble_gap_master_id_t;


/**@brief GAP Signing Information. */
typedef struct
{
    uint8_t csrk[BLE_GAP_SEC_KEY_LEN];        /**< Connection Signature Resolving Key. */
} ble_gap_sign_info_t;


/**@brief GAP LE Secure Connections P-256 Public Key. */
typedef struct
{
    uint8_t pk[BLE_GAP_LESC_P256_PK_LEN];        /**< LE Secure Connections Elliptic Curve Diffie-Hellman P-256 Public Key. Stored in the standard SMP protocol format: {X,Y} both in little-endian. */
} ble_gap_lesc_p256_pk_t;


/**@brief GAP LE Secure Connections DHKey. */
typedef struct
{
    uint8_t key[BLE_GAP_LESC_DHKEY_LEN];        /**< LE Secure Connections Elliptic Curve Diffie-Hellman Key. Stored in little-endian. */
} ble_gap_lesc_dhkey_t;


/**@brief GAP LE Secure Connections OOB data. */
typedef struct
{
    ble_gap_addr_t addr;                         /**< Bluetooth address of the device. */
    uint8_t r[BLE_GAP_SEC_KEY_LEN];              /**< Random Number. */
    uint8_t c[BLE_GAP_SEC_KEY_LEN];              /**< Confirm Value. */
} ble_gap_lesc_oob_data_t;


