micropython/micropython/ports/nrf/bluetooth/s140_nrf52_7.0.1/s140_nrf52_7.0.1_API/include/ble_gap.h
/**@brief Event structure for @ref BLE_GAP_EVT_CONNECTED. */
typedef struct
{
    ble_gap_addr_t peer_addr;                   /**< Bluetooth address of the peer device. If the peer_addr resolved: @ref ble_gap_addr_t::addr_id_peer is set to 1
                                                     and the address is the device's identity address. */
    uint8_t role;                               /**< BLE role for this connection, see @ref BLE_GAP_ROLES */
    ble_gap_conn_params_t conn_params;          /**< GAP Connection Parameters. */
    uint8_t adv_handle;                         /**< Advertising handle in which advertising has ended.
                                                     This variable is only set if role is set to @ref BLE_GAP_ROLE_PERIPH. */
    ble_gap_adv_data_t adv_data;                /**< Advertising buffers corresponding to the terminated
                                                     advertising set. The advertising buffers provided in
                                                     @ref sd_ble_gap_adv_set_configure are now released.
                                                     This variable is only set if role is set to @ref BLE_GAP_ROLE_PERIPH. */
} ble_gap_evt_connected_t;


/**@brief Event structure for @ref BLE_GAP_EVT_DISCONNECTED. */
typedef struct
{
    uint8_t reason;                             /**< HCI error code, see @ref BLE_HCI_STATUS_CODES. */
} ble_gap_evt_disconnected_t;


/**@brief Event structure for @ref BLE_GAP_EVT_CONN_PARAM_UPDATE. */
typedef struct
{
    ble_gap_conn_params_t conn_params;          /**<  GAP Connection Parameters. */
} ble_gap_evt_conn_param_update_t;

/**@brief Event structure for @ref BLE_GAP_EVT_PHY_UPDATE_REQUEST. */
typedef struct
{
    ble_gap_phys_t peer_preferred_phys;          /**< The PHYs the peer prefers to use. */
} ble_gap_evt_phy_update_request_t;

/**@brief Event Structure for @ref BLE_GAP_EVT_PHY_UPDATE. */
typedef struct
{
    uint8_t status;                             /**< Status of the procedure, see @ref BLE_HCI_STATUS_CODES.*/
    uint8_t tx_phy;                             /**< TX PHY for this connection, see @ref BLE_GAP_PHYS. */
    uint8_t rx_phy;                             /**< RX PHY for this connection, see @ref BLE_GAP_PHYS. */
} ble_gap_evt_phy_update_t;

/**@brief Event structure for @ref BLE_GAP_EVT_SEC_PARAMS_REQUEST. */
typedef struct
{
    ble_gap_sec_params_t peer_params;           /**< Initiator Security Parameters. */
} ble_gap_evt_sec_params_request_t;


/**@brief Event structure for @ref BLE_GAP_EVT_SEC_INFO_REQUEST. */
typedef struct
{
    ble_gap_addr_t peer_addr;                        /**< Bluetooth address of the peer device. */
    ble_gap_master_id_t master_id;                   /**< Master Identification for LTK lookup. */
    uint8_t enc_info  : 1;                           /**< If 1, Encryption Information required. */
    uint8_t id_info   : 1;                           /**< If 1, Identity Information required. */
    uint8_t sign_info : 1;                           /**< If 1, Signing Information required. */
} ble_gap_evt_sec_info_request_t;


/**@brief Event structure for @ref BLE_GAP_EVT_PASSKEY_DISPLAY. */
typedef struct
{
    uint8_t passkey[BLE_GAP_PASSKEY_LEN];       /**< 6-digit passkey in ASCII ('0'-'9' digits only). */
    uint8_t match_request : 1;                  /**< If 1 requires the application to report the match using @ref sd_ble_gap_auth_key_reply
                                                     with either @ref BLE_GAP_AUTH_KEY_TYPE_NONE if there is no match or
                                                     @ref BLE_GAP_AUTH_KEY_TYPE_PASSKEY if there is a match. */
} ble_gap_evt_passkey_display_t;

/**@brief Event structure for @ref BLE_GAP_EVT_KEY_PRESSED. */
typedef struct
{
    uint8_t kp_not;       /**< Keypress notification type, see @ref BLE_GAP_KP_NOT_TYPES. */
} ble_gap_evt_key_pressed_t;


/**@brief Event structure for @ref BLE_GAP_EVT_AUTH_KEY_REQUEST. */
typedef struct
{
    uint8_t key_type;                           /**< See @ref BLE_GAP_AUTH_KEY_TYPES. */
} ble_gap_evt_auth_key_request_t;

/**@brief Event structure for @ref BLE_GAP_EVT_LESC_DHKEY_REQUEST. */
typedef struct
{
    ble_gap_lesc_p256_pk_t *p_pk_peer; /**< LE Secure Connections remote P-256 Public Key. This will point to the application-supplied memory
                                           inside the keyset during the call to @ref sd_ble_gap_sec_params_reply. */
    uint8_t oobd_req       : 1;       /**< LESC OOB data required. A call to @ref sd_ble_gap_lesc_oob_data_set is required to complete the procedure. */
} ble_gap_evt_lesc_dhkey_request_t;


/**@brief Security levels supported.
 * @note  See Bluetooth Specification Version 4.2 Volume 3, Part C, Chapter 10, Section 10.2.1.
*/
typedef struct
{
    uint8_t lv1 : 1;                            /**< If 1: Level 1 is supported. */
    uint8_t lv2 : 1;                            /**< If 1: Level 2 is supported. */
    uint8_t lv3 : 1;                            /**< If 1: Level 3 is supported. */
    uint8_t lv4 : 1;                            /**< If 1: Level 4 is supported. */
} ble_gap_sec_levels_t;


/**@brief Encryption Key. */
typedef struct
{
    ble_gap_enc_info_t enc_info;              /**< Encryption Information. */
    ble_gap_master_id_t master_id;            /**< Master Identification. */
} ble_gap_enc_key_t;


/**@brief Identity Key. */
typedef struct
{
    ble_gap_irk_t id_info;                    /**< Identity Resolving Key. */
    ble_gap_addr_t id_addr_info;              /**< Identity Address. */
} ble_gap_id_key_t;


/**@brief Security Keys. */
typedef struct
{
    ble_gap_enc_key_t *p_enc_key;              /**< Encryption Key, or NULL. */
    ble_gap_id_key_t *p_id_key;                /**< Identity Key, or NULL. */
    ble_gap_sign_info_t *p_sign_key;           /**< Signing Key, or NULL. */
    ble_gap_lesc_p256_pk_t *p_pk;              /**< LE Secure Connections P-256 Public Key. When in debug mode the application must use the value defined
                                                    in the Core Bluetooth Specification v4.2 Vol.3, Part H, Section 2.3.5.6.1 */
} ble_gap_sec_keys_t;


/**@brief Security key set for both local and peer keys. */
typedef struct
{
    ble_gap_sec_keys_t keys_own;              /**< Keys distributed by the local device. For LE Secure Connections the encryption key will be generated locally and will always be stored if bonding. */
    ble_gap_sec_keys_t keys_peer;             /**< Keys distributed by the remote device. For LE Secure Connections, p_enc_key must always be NULL. */
} ble_gap_sec_keyset_t;


/**@brief Data Length Update Procedure parameters. */
typedef struct
{
    uint16_t max_tx_octets; /**< Maximum number of payload octets that a Controller supports for transmission of a single Link Layer Data Channel PDU. */
    uint16_t max_rx_octets; /**< Maximum number of payload octets that a Controller supports for reception of a single Link Layer Data Channel PDU. */
    uint16_t max_tx_time_us; /**< Maximum time, in microseconds, that a Controller supports for transmission of a single Link Layer Data Channel PDU. */
    uint16_t max_rx_time_us; /**< Maximum time, in microseconds, that a Controller supports for reception of a single Link Layer Data Channel PDU. */
} ble_gap_data_length_params_t;


/**@brief Data Length Update Procedure local limitation. */
typedef struct
{
    uint16_t tx_payload_limited_octets; /**< If > 0, the requested TX packet length is too long by this many octets. */
    uint16_t rx_payload_limited_octets; /**< If > 0, the requested RX packet length is too long by this many octets. */
    uint16_t tx_rx_time_limited_us;   /**< If > 0, the requested combination of TX and RX packet lengths is too long by this many microseconds. */
} ble_gap_data_length_limitation_t;


/**@brief Event structure for @ref BLE_GAP_EVT_AUTH_STATUS. */
typedef struct
{
    uint8_t auth_status;                        /**< Authentication status, see @ref BLE_GAP_SEC_STATUS. */
    uint8_t error_src : 2;                      /**< On error, source that caused the failure, see @ref BLE_GAP_SEC_STATUS_SOURCES. */
    uint8_t bonded : 1;                         /**< Procedure resulted in a bond. */
    uint8_t lesc : 1;                           /**< Procedure resulted in a LE Secure Connection. */
    ble_gap_sec_levels_t sm1_levels;            /**< Levels supported in Security Mode 1. */
    ble_gap_sec_levels_t sm2_levels;            /**< Levels supported in Security Mode 2. */
    ble_gap_sec_kdist_t kdist_own;              /**< Bitmap stating which keys were exchanged (distributed) by the local device. If bonding with LE Secure Connections, the enc bit will be always set. */
    ble_gap_sec_kdist_t kdist_peer;             /**< Bitmap stating which keys were exchanged (distributed) by the remote device. If bonding with LE Secure Connections, the enc bit will never be set. */
} ble_gap_evt_auth_status_t;


/**@brief Event structure for @ref BLE_GAP_EVT_CONN_SEC_UPDATE. */
typedef struct
{
    ble_gap_conn_sec_t conn_sec;                /**< Connection security level. */
} ble_gap_evt_conn_sec_update_t;


/**@brief Event structure for @ref BLE_GAP_EVT_TIMEOUT. */
typedef struct
{
    uint8_t src;                                /**< Source of timeout event, see @ref BLE_GAP_TIMEOUT_SOURCES. */
    union
    {
        ble_data_t adv_report_buffer;           /**< If source is set to @ref BLE_GAP_TIMEOUT_SRC_SCAN, the released
                                                     scan buffer is contained in this field. */
    } params;                                   /**< Event Parameters. */
} ble_gap_evt_timeout_t;


