micropython/micropython/ports/nrf/bluetooth/s140_nrf52_7.0.1/s140_nrf52_7.0.1_API/include/ble_gap.h
/**@brief Event structure for @ref BLE_GAP_EVT_RSSI_CHANGED. */
typedef struct
{
    int8_t rssi;                                /**< Received Signal Strength Indication in dBm.
                                                     @note ERRATA-153 and ERRATA-225 require the rssi sample to be compensated based on a temperature measurement. */
    uint8_t ch_index;                           /**< Data Channel Index on which the Signal Strength is measured (0-36). */
} ble_gap_evt_rssi_changed_t;

/**@brief Event structure for @ref BLE_GAP_EVT_ADV_SET_TERMINATED */
typedef struct
{
    uint8_t reason;                                   /**< Reason for why the advertising set terminated. See
                                                           @ref BLE_GAP_EVT_ADV_SET_TERMINATED_REASON. */
    uint8_t adv_handle;                               /**< Advertising handle in which advertising has ended. */
    uint8_t num_completed_adv_events;                 /**< If @ref ble_gap_adv_params_t::max_adv_evts was not set to 0,
                                                           this field indicates the number of completed advertising events. */
    ble_gap_adv_data_t adv_data;                      /**< Advertising buffers corresponding to the terminated
                                                           advertising set. The advertising buffers provided in
                                                           @ref sd_ble_gap_adv_set_configure are now released. */
} ble_gap_evt_adv_set_terminated_t;

/**@brief Event structure for @ref BLE_GAP_EVT_ADV_REPORT.
 *
 * @note If @ref ble_gap_adv_report_type_t::status is set to @ref BLE_GAP_ADV_DATA_STATUS_INCOMPLETE_MORE_DATA,
 *       not all fields in the advertising report may be available.
 *
 * @note When ble_gap_adv_report_type_t::status is not set to @ref BLE_GAP_ADV_DATA_STATUS_INCOMPLETE_MORE_DATA,
 *       scanning will be paused. To continue scanning, call @ref sd_ble_gap_scan_start.
 */
typedef struct
{
    ble_gap_adv_report_type_t type;                /**< Advertising report type. See @ref ble_gap_adv_report_type_t. */
    ble_gap_addr_t peer_addr;                      /**< Bluetooth address of the peer device. If the peer_addr is resolved:
                                                        @ref ble_gap_addr_t::addr_id_peer is set to 1 and the address is the
                                                        peer's identity address. */
    ble_gap_addr_t direct_addr;                    /**< Contains the target address of the advertising event if
                                                        @ref ble_gap_adv_report_type_t::directed is set to 1. If the
                                                        SoftDevice was able to resolve the address,
                                                        @ref ble_gap_addr_t::addr_id_peer is set to 1 and the direct_addr
                                                        contains the local identity address. If the target address of the
                                                        advertising event is @ref BLE_GAP_ADDR_TYPE_RANDOM_PRIVATE_RESOLVABLE,
                                                        and the SoftDevice was unable to resolve it, the application may try
                                                        to resolve this address to find out if the advertising event was
                                                        directed to us. */
    uint8_t primary_phy;                           /**< Indicates the PHY on which the primary advertising packet was received.
                                                        See @ref BLE_GAP_PHYS. */
    uint8_t secondary_phy;                         /**< Indicates the PHY on which the secondary advertising packet was received.
                                                        See @ref BLE_GAP_PHYS. This field is set to @ref BLE_GAP_PHY_NOT_SET if no packets
                                                        were received on a secondary advertising channel. */
    int8_t tx_power;                               /**< TX Power reported by the advertiser in the last packet header received.
                                                        This field is set to @ref BLE_GAP_POWER_LEVEL_INVALID if the
                                                        last received packet did not contain the Tx Power field.
                                                        @note TX Power is only included in extended advertising packets. */
    int8_t rssi;                                   /**< Received Signal Strength Indication in dBm of the last packet received.
                                                        @note ERRATA-153 and ERRATA-225 require the rssi sample to be compensated based on a temperature measurement. */
    uint8_t ch_index;                              /**< Channel Index on which the last advertising packet is received (0-39). */
    uint8_t set_id;                                /**< Set ID of the received advertising data. Set ID is not present
                                                        if set to @ref BLE_GAP_ADV_REPORT_SET_ID_NOT_AVAILABLE. */
    uint16_t data_id : 12;                         /**< The advertising data ID of the received advertising data. Data ID
                                                        is not present if @ref ble_gap_evt_adv_report_t::set_id is set to
                                                        @ref BLE_GAP_ADV_REPORT_SET_ID_NOT_AVAILABLE. */
    ble_data_t data;                               /**< Received advertising or scan response data. If
                                                        @ref ble_gap_adv_report_type_t::status is not set to
                                                        @ref BLE_GAP_ADV_DATA_STATUS_INCOMPLETE_MORE_DATA, the data buffer provided
                                                        in @ref sd_ble_gap_scan_start is now released. */
    ble_gap_aux_pointer_t aux_pointer;             /**< The offset and PHY of the next advertising packet in this extended advertising
                                                        event. @note This field is only set if @ref ble_gap_adv_report_type_t::status
                                                        is set to @ref BLE_GAP_ADV_DATA_STATUS_INCOMPLETE_MORE_DATA. */
} ble_gap_evt_adv_report_t;


/**@brief Event structure for @ref BLE_GAP_EVT_SEC_REQUEST. */
typedef struct
{
    uint8_t bond       : 1;                        /**< Perform bonding. */
    uint8_t mitm       : 1;                        /**< Man In The Middle protection requested. */
    uint8_t lesc       : 1;                        /**< LE Secure Connections requested. */
    uint8_t keypress   : 1;                        /**< Generation of keypress notifications requested. */
} ble_gap_evt_sec_request_t;


/**@brief Event structure for @ref BLE_GAP_EVT_CONN_PARAM_UPDATE_REQUEST. */
typedef struct
{
    ble_gap_conn_params_t conn_params;          /**<  GAP Connection Parameters. */
} ble_gap_evt_conn_param_update_request_t;


/**@brief Event structure for @ref BLE_GAP_EVT_SCAN_REQ_REPORT. */
typedef struct
{
    uint8_t adv_handle;                      /**< Advertising handle for the advertising set which received the Scan Request */
    int8_t rssi;                             /**< Received Signal Strength Indication in dBm.
                                                  @note ERRATA-153 and ERRATA-225 require the rssi sample to be compensated based on a temperature measurement. */
    ble_gap_addr_t peer_addr;                /**< Bluetooth address of the peer device. If the peer_addr resolved: @ref ble_gap_addr_t::addr_id_peer is set to 1
                                                  and the address is the device's identity address. */
} ble_gap_evt_scan_req_report_t;


/**@brief Event structure for @ref BLE_GAP_EVT_DATA_LENGTH_UPDATE_REQUEST. */
typedef struct
{
    ble_gap_data_length_params_t peer_params; /**< Peer data length parameters. */
} ble_gap_evt_data_length_update_request_t;

/**@brief Event structure for @ref BLE_GAP_EVT_DATA_LENGTH_UPDATE.
 *
 * @note This event may also be raised after a PHY Update procedure.
 */
typedef struct
{
    ble_gap_data_length_params_t effective_params; /**< The effective data length parameters. */
} ble_gap_evt_data_length_update_t;


/**@brief Event structure for @ref BLE_GAP_EVT_QOS_CHANNEL_SURVEY_REPORT. */
typedef struct
{
    int8_t channel_energy[BLE_GAP_CHANNEL_COUNT]; /**< The measured energy on the Bluetooth Low Energy
                                                     channels, in dBm, indexed by Channel Index.
                                                     If no measurement is available for the given channel, channel_energy is set to
                                                     @ref BLE_GAP_POWER_LEVEL_INVALID. */
} ble_gap_evt_qos_channel_survey_report_t;

/**@brief GAP event structure. */
typedef struct
{
    uint16_t conn_handle;                                   /**< Connection Handle on which event occurred. */
    union                                                   /**< union alternative identified by evt_id in enclosing struct. */
    {
        ble_gap_evt_connected_t connected;                                  /**< Connected Event Parameters. */
        ble_gap_evt_disconnected_t disconnected;                            /**< Disconnected Event Parameters. */
        ble_gap_evt_conn_param_update_t conn_param_update;                  /**< Connection Parameter Update Parameters. */
        ble_gap_evt_sec_params_request_t sec_params_request;                /**< Security Parameters Request Event Parameters. */
        ble_gap_evt_sec_info_request_t sec_info_request;                    /**< Security Information Request Event Parameters. */
        ble_gap_evt_passkey_display_t passkey_display;                      /**< Passkey Display Event Parameters. */
        ble_gap_evt_key_pressed_t key_pressed;                              /**< Key Pressed Event Parameters. */
        ble_gap_evt_auth_key_request_t auth_key_request;                    /**< Authentication Key Request Event Parameters. */
        ble_gap_evt_lesc_dhkey_request_t lesc_dhkey_request;                /**< LE Secure Connections DHKey calculation request. */
        ble_gap_evt_auth_status_t auth_status;                              /**< Authentication Status Event Parameters. */
        ble_gap_evt_conn_sec_update_t conn_sec_update;                      /**< Connection Security Update Event Parameters. */
        ble_gap_evt_timeout_t timeout;                                      /**< Timeout Event Parameters. */
        ble_gap_evt_rssi_changed_t rssi_changed;                            /**< RSSI Event Parameters. */
        ble_gap_evt_adv_report_t adv_report;                                /**< Advertising Report Event Parameters. */
        ble_gap_evt_adv_set_terminated_t adv_set_terminated;                /**< Advertising Set Terminated Event Parameters. */
        ble_gap_evt_sec_request_t sec_request;                              /**< Security Request Event Parameters. */
        ble_gap_evt_conn_param_update_request_t conn_param_update_request;  /**< Connection Parameter Update Parameters. */
        ble_gap_evt_scan_req_report_t scan_req_report;                      /**< Scan Request Report Parameters. */
        ble_gap_evt_phy_update_request_t phy_update_request;                /**< PHY Update Request Event Parameters. */
        ble_gap_evt_phy_update_t phy_update;                                /**< PHY Update Parameters. */
        ble_gap_evt_data_length_update_request_t data_length_update_request; /**< Data Length Update Request Event Parameters. */
        ble_gap_evt_data_length_update_t data_length_update;                /**< Data Length Update Event Parameters. */
        ble_gap_evt_qos_channel_survey_report_t qos_channel_survey_report;  /**< Quality of Service (QoS) Channel Survey Report Parameters. */
    } params;                                                               /**< Event Parameters. */
} ble_gap_evt_t;


/**
 * @brief BLE GAP connection configuration parameters, set with @ref sd_ble_cfg_set.
 *
 * @retval ::NRF_ERROR_CONN_COUNT     The connection count for the connection configurations is zero.
 * @retval ::NRF_ERROR_INVALID_PARAM  One or more of the following is true:
 *                                    - The sum of conn_count for all connection configurations combined exceeds UINT8_MAX.
 *                                    - The event length is smaller than @ref BLE_GAP_EVENT_LENGTH_MIN.
 */
typedef struct
{
    uint8_t conn_count;    /**< The number of concurrent connections the application can create with this configuration.
                                The default and minimum value is @ref BLE_GAP_CONN_COUNT_DEFAULT. */
    uint16_t event_length; /**< The time set aside for this connection on every connection interval in 1.25 ms units.
                                The default value is @ref BLE_GAP_EVENT_LENGTH_DEFAULT, the minimum value is @ref BLE_GAP_EVENT_LENGTH_MIN.
                                The event length and the connection interval are the primary parameters
                                for setting the throughput of a connection.
                                See the SoftDevice Specification for details on throughput. */
} ble_gap_conn_cfg_t;


/**
 * @brief Configuration of maximum concurrent connections in the different connected roles, set with
 * @ref sd_ble_cfg_set.
 *
 * @retval ::NRF_ERROR_CONN_COUNT     The sum of periph_role_count and central_role_count is too
 *                                    large. The maximum supported sum of concurrent connections is
 *                                    @ref BLE_GAP_ROLE_COUNT_COMBINED_MAX.
 * @retval ::NRF_ERROR_INVALID_PARAM  central_sec_count is larger than central_role_count.
 * @retval ::NRF_ERROR_RESOURCES      The adv_set_count is too large. The maximum
 *                                    supported advertising handles is
 *                                    @ref BLE_GAP_ADV_SET_COUNT_MAX.
 */
typedef struct
{
    uint8_t adv_set_count;    /**< Maximum number of advertising sets. Default value is @ref BLE_GAP_ADV_SET_COUNT_DEFAULT. */
    uint8_t periph_role_count; /**< Maximum number of connections concurrently acting as a peripheral. Default value is @ref BLE_GAP_ROLE_COUNT_PERIPH_DEFAULT. */
    uint8_t central_role_count; /**< Maximum number of connections concurrently acting as a central. Default value is @ref BLE_GAP_ROLE_COUNT_CENTRAL_DEFAULT. */
    uint8_t central_sec_count; /**< Number of SMP instances shared between all connections acting as a central. Default value is @ref BLE_GAP_ROLE_COUNT_CENTRAL_SEC_DEFAULT. */
    uint8_t qos_channel_survey_role_available : 1; /**< If set, the Quality of Service (QoS) channel survey module is available to the
                                                    application using @ref sd_ble_gap_qos_channel_survey_start. */
} ble_gap_cfg_role_count_t;


/**
 * @brief Device name and its properties, set with @ref sd_ble_cfg_set.
 *
 * @note  If the device name is not configured, the default device name will be
 *        @ref BLE_GAP_DEVNAME_DEFAULT, the maximum device name length will be
 *        @ref BLE_GAP_DEVNAME_DEFAULT_LEN, vloc will be set to @ref BLE_GATTS_VLOC_STACK and the device name
 *        will have no write access.
 *
 * @note  If @ref max_len is more than @ref BLE_GAP_DEVNAME_DEFAULT_LEN and vloc is set to @ref BLE_GATTS_VLOC_STACK,
 *        the attribute table size must be increased to have room for the longer device name (see
 *        @ref sd_ble_cfg_set and @ref ble_gatts_cfg_attr_tab_size_t).
 *
 * @note  If vloc is @ref BLE_GATTS_VLOC_STACK :
 *        - p_value must point to non-volatile memory (flash) or be NULL.
 *        - If p_value is NULL, the device name will initially be empty.
 *
 * @note  If vloc is @ref BLE_GATTS_VLOC_USER :
 *        - p_value cannot be NULL.
 *        - If the device name is writable, p_value must point to volatile memory (RAM).
 *
 * @retval ::NRF_ERROR_INVALID_PARAM  One or more of the following is true:
 *                                    - Invalid device name location (vloc).
 *                                    - Invalid device name security mode.
 * @retval ::NRF_ERROR_INVALID_LENGTH One or more of the following is true:
 *                                    - The device name length is invalid (must be between 0 and @ref BLE_GAP_DEVNAME_MAX_LEN).
 *                                    - The device name length is too long for the given Attribute Table.
 * @retval ::NRF_ERROR_NOT_SUPPORTED  Device name security mode is not supported.
 */
typedef struct
{
    ble_gap_conn_sec_mode_t write_perm;  /**< Write permissions. */
    uint8_t vloc : 2;                    /**< Value location, see @ref BLE_GATTS_VLOCS.*/
    uint8_t *p_value;                    /**< Pointer to where the value (device name) is stored or will be stored. */
    uint16_t current_len;                /**< Current length in bytes of the memory pointed to by p_value.*/
    uint16_t max_len;                    /**< Maximum length in bytes of the memory pointed to by p_value.*/
} ble_gap_cfg_device_name_t;


/**@brief Peripheral Preferred Connection Parameters include configuration parameters, set with @ref sd_ble_cfg_set. */
typedef struct
{
    uint8_t include_cfg;   /**< Inclusion configuration of the Peripheral Preferred Connection Parameters characteristic.
                                See @ref BLE_GAP_CHAR_INCL_CONFIG. Default is @ref BLE_GAP_PPCP_INCL_CONFIG_DEFAULT. */
} ble_gap_cfg_ppcp_incl_cfg_t;


